Tobias0110/STM32_RF_modulator/Src/main.c
	for(i=0;i<=4;i++)
	{
		GPIOC->ODR &= ~0xFF;
		GPIOC->ODR |= w[i];
		GPIOC->ODR |= 0x01 << 9; //W_CLK high
		GPIOC->ODR &= ~(0x01 << 9);  //W_CLK low
	}
	
	//Set FQ_UD to high
	GPIOC->ODR |= 0x01 << 8;
	
}
//I do not plan on implementing AM modulation (makes the transmitter simpler and cheaper)
__forceinline static void bc_am()  //broadcast quality AM. Uses max. sample rate while optaining 12 bit PWM range.
{
	//DC Removal variables
	volatile static float w_dc = 0, w_dc1 = 0;
	static const float a_dc = 0.99;

	//Remove DC
	w_dc = (adc_value >> 3) + a_dc * w_dc1;
	amplitude = ((int) (w_dc - w_dc1)) + 2048; //Add DC offset for carrier (2^12 / 2 = 2048)
	w_dc1 = w_dc;
	new_sample = 0;
}
__forceinline static void ssb(uint8_t lsb)
{
	//DC Removal variables
	volatile static float w_dc = 0, w_dc1 = 0;
	static const float a_dc = 0.99;
	int16_t hilbert_input_i;
	static q31_t hilbert_input;

	//Hilbert-Filter variables
	static q31_t w[16], y_I = 0, y_Q = 0;
	static q31_t amplitude_q;
	static const q31_t a[4] = {toQ31(0.052981), toQ31(0.088199), toQ31(0.18683), toQ31(0.62783)};  //calculated with octave
	static uint8_t pos = 0; //ringbuffer position
	static const q31_t div = toQ31(0.5);
	
	//Phase to Frquency variables
	static float  phase;
	static uint16_t prev_phase;
	
	//will be implemented in q31 in the future
	w_dc = adc_value + a_dc * w_dc1;
	hilbert_input_i = (int) (w_dc - w_dc1);
	w_dc1 = w_dc;
	
	hilbert_input = mulQ31((hilbert_input_i * ( toQ31(1) / 2048 )), div);

	w[++pos & 0x0F] = hilbert_input;
	y_I = rW(7);
	//structure optimation inspired by wikipedia: Hilbert-Transformation
	//Designed with Octave
	y_Q = mulQ31(rW(14) - rW(0), a[0]) +
        mulQ31(rW(12) - rW(2), a[1]) +
        mulQ31(rW(10) - rW(4), a[2]) +
        mulQ31(rW(8) - rW(6), a[3]);
				
//++++++++THE FOLLOWING PART IS UNDER CONSTRUCTION++++++++
	
	//Komponentenschreibweise zu Winkelschreibweise (Component notation to Angular notation?)
	arm_sqrt_q31(mulQ31(mulQ31(y_I, y_I), div) + mulQ31(mulQ31(y_Q, y_Q), div), &amplitude_q);
	//amplitude = (uint16_t) mulQ31( amplitude_q, (q31_t) toQ31( 4096 / toQ31(1))); //Not tested
	
		phase = atan2f(fromQ31(y_Q), fromQ31(y_I));
		//phase = y_Q / y_I;
		//phase = (PI / 4) * phase + 0.285 * phase * (1 - fabs(phase));
		if(phase < 0) phase = 2 * PI + phase; //convert negativ phase to positiv phase (atan2f returns a value between -pi and +pi)
		phase = (phase / (2 * PI)) * PHASE_RES; //PHASE_RES is the phase resulution (importent when converting to int)

	if(y_I == 0) phase = 0;
	
	//The differential of a phase gives the frequency change (you can convert a frequency modulator into a phase modulator)
	dif = (int) phase - prev_phase;
	prev_phase = (int) phase;
	
	//a "circular" nummber set is needed
	if(dif < 0) dif = dif + PHASE_RES; //avoid negativ phase differences (and therefore negative frequencies)
	
	if(dif > MAX_F) //Reducing the bandwidth while maintaining the required frequency shift (delaying to the next sample)
	{
		prev_phase = phase - (dif - MAX_F);
		dif = MAX_F;
	}
	
	offset = dif;
	
	carrier = 1;
	if(amplitude_q < 10) carrier = 0; //no carrier when there is no audio input and thus no amplitude
	
	//LSB
	if(lsb == 1) offset = offset * -1; //mirror the frequencies on the carrier.
	
	//DDS Phase Reg
	phase_reg = 0;
	
	new_sample = 0; //calculation finished
	
//++++++++END OF CONSTRUCTION AREA++++++++
}

__forceinline static void ssb_pm(uint8_t lsb) //uses the phase modulation of the dds
{
	//DC Removal variables
	volatile static float w_dc = 0, w_dc1 = 0;
	static const float a_dc = 0.99;
	int16_t hilbert_input_i;
	static q31_t hilbert_input;

	//Hilbert-Filter variables
	static q31_t w[16], y_I = 0, y_Q = 0;
	static q31_t amplitude_q;
	static const q31_t a[4] = {toQ31(0.052981), toQ31(0.088199), toQ31(0.18683), toQ31(0.62783)};  //calculated with octave
	static uint8_t pos = 0; //ringbuffer position
	static const q31_t div = toQ31(0.5);
	
	//Phase variables
	static float  phase;
	
	//will be implemented in q31 in the future
	w_dc = adc_value + a_dc * w_dc1;
	hilbert_input_i = (int) (w_dc - w_dc1);
	w_dc1 = w_dc;
	
	hilbert_input = mulQ31((hilbert_input_i * ( toQ31(1) / 2048 )), div);

	w[++pos & 0x0F] = hilbert_input;
	y_I = rW(7);
	//structure optimation inspired by wikipedia: Hilbert-Transformation
	//Designed with Octave
	y_Q = mulQ31(rW(14) - rW(0), a[0]) +
        mulQ31(rW(12) - rW(2), a[1]) +
        mulQ31(rW(10) - rW(4), a[2]) +
        mulQ31(rW(8) - rW(6), a[3]);
	
	//Komponentenschreibweise zu Winkelschreibweise (Component notation to Angular notation?)
	arm_sqrt_q31(mulQ31(mulQ31(y_I, y_I), div) + mulQ31(mulQ31(y_Q, y_Q), div), &amplitude_q);
	//amplitude = (uint16_t) mulQ31( amplitude_q, (q31_t) toQ31( 4096 / toQ31(1))); //Not tested
	
	if((y_Q != 0) && (y_I != 0))
	{
		phase = atan2f(fromQ31(y_Q), fromQ31(y_I));
		//phase = y_Q / y_I;
		//phase = (PI / 4) * phase + 0.285 * phase * (1 - fabs(phase));
		if(phase < 0) phase = 2 * PI + phase; //convert negativ phase to positiv phase (atan2f returns a value between -pi and +pi)
		phase = (phase / (2 * PI)) * PHASE_RES_2; //PHASE_RES is the phase resulution (importent when converting to int) (0 to 2)
	}
	else
	{
		phase = 0;
	}
	phase_reg = (int) round(phase);
	
	carrier = 1;
	if(amplitude_q == 0) carrier = 0; //no carrier when there is no audio input and thus no amplitude
	
	new_sample = 0; //calculation finished
	
}

__forceinline static void nfm(uint8_t comp)
{
	//DC Removal variables
	static float w_dc = 0, w_dc1 = 0;
	static const float a_dc = 0.3;
	static float out_dc;
	
	static int16_t gain = 0;
	static uint16_t to_high = 0, to_low = 0;
	
	//DC blocking filter (IIR Filter) and Preemphasis Filter
	w_dc = adc_value + a_dc * w_dc1;
	out_dc = (w_dc - w_dc1);
	w_dc1 = w_dc;
	
	if(comp == 0) gain = 0; //Deactivates the compressor
	offset = (int32_t) (out_dc * (50 + gain));
	
	//Compressor
	if(offset > 50000) //Limmit frequency drift
	{
		offset = 50000;
		to_high++;
	}
	if(offset < -50000) //Limmit frequency drift
	{
		offset = -50000;
		to_high++;
	}
	
	if(to_high > 0) //Release
	{
		gain--;
		to_high--;
	}
	else if (offset > 100) //avoid triggering on silence
	{
		to_low++;
		if(to_low > 5) //Attack
		{
			gain++;
			to_low = 0;
		}
	}
	
	carrier = 1;
	new_sample = 0; //calculation finished
}

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

